app/Controllers/Auth.php

SELECT *
FROM `users`
WHERE `Username` = '1402001'
AND `Password` = '5787be38ee03a9ae5360f54d9026465f'
 LIMIT 1
---
    public function doLogin()
    {
        $session = session();
        $model = new UserModel();

        $username = $this->request->getPost('username');
        $password = md5($this->request->getPost('password')); // demo only

        $user = $model->where('Username', $username)
            ->where('Password', $password)
            ->first();