app/Controllers/Dashboard.php

    public function index($level)
    {
        $session = session();

        if (!$session->get('logged_in')) {
            return redirect()->to('/');
        }

        if ($session->get('level') !== $level) {
            return redirect()->to('/dashboard/' . $session->get('level'));
        }

        $viewPath = "dashboard/$level";
        if (!is_file(APPPATH . 'Views/' . $viewPath . '.php')) {
            return "View untuk level '$level' belum tersedia.";
        }

        $model = new UserModel();
        $user = $model->where('username', $session->get('username'))->first();
---
SELECT *
FROM `users`
WHERE `username` = '1402001'
 LIMIT 1