app/Controllers/SurveyMahasiswa.php

    public function dosen()
    {
        $session = session();
        $username = $session->get('username');
        if (!$session->get('logged_in')) {
            return redirect()->to('/');
        }

        if ($session->get('level') !== "Mahasiswa") {
            return redirect()->to('/dashboard/' . $session->get('level'));
        }

        $db = db_connect();

        $user = $db->table('users')->where('username', $username)->get()->getRow();
---
SELECT *
FROM `users`
WHERE `username` = '1502036'